# coding: utf-8

SUBJECT = {
    'GS001': '语文',
    'GS002': '数学',
    'GS003': '英语',
    'GS004': '科学',
    'GS005': '体育',
    'GS006': '音乐',
    'GS007': '美术',
    'GS008': '校本课',
    'GS017': '思品',
    'GS009': '品德与生活',
    'GS010': '品德与社会',
    'GS011': '综合实践',
    'GS012': '写字',
    'GS013': '信息',
    'GS014': '少先队活动课',
    'GS015': '心理',
    'GS016': '其他'
}

GENDER = {
    'MALE': '男',
    'FEMALE': '女'
}

GRADE = {
    '1': '一年级',
    '2': '二年级',
    '3': '三年级',
    '4': '四年级',
    '5': '五年级',
    '6': '六年级',
    '7': '初一',
    '8': '初二',
    '9': '初三',
    '10': '高一',
    '11': '高二',
    '12': '高三'
}

SECTION = {
    'FIRST_HALF': "上学期",
    'SECOND_HALF': "下学期"
}

SCHOOL_YEAR = {
    '2010': '2010-2011学年',
    '2011': '2011-2012学年',
    '2012': '2012-2013学年',
    '2013': '2013-2014学年',
    '2014': '2014-2015学年',
    '2015': '2015-2016学年',
    '2016': '2016-2017学年',
    '2017': '2017-2018学年',
    '2018': '2018-2019学年',
    '2019': '2019-2020学年',
    '2020': '2020-2021学年',
    '2021': '2021-2022学年',
    '2022': '2022-2023学年',
    '2023': '2023-2024学年',
    '2024': '2024-2025学年',
    '2025': '2025-2026学年'
}

PAPER_TYPE = {
  'PAPER_UNIT': '单元考',
  'PAPER_MIDLE_TERM': '半期考',
  'PAPER_LAST': '期末考',
  'PAPER_QULITY': '质检',
  'PAPER_MODEL': '模拟考',
  'PAPER_MIDLE': '中考',
  'PAPER_HIGH': '高考'
}

EXAM_STATUS = {
    '已删除': -99,
    '审核超时': -2,
    '审核不通过': -1,
    '未审核': 0,
    '正在审核': 1,
    '审核通过': 5,
    '已采纳': 2,
    '预处理': 3,
    '预处理完成': 4

}

QUEST_STATUS = {
    '已删除': -99,
    '未处理': 0,
    '正在录题': 1,
    '审核不通过': 2,
    '完成录题': 3,
    '正在解答': 4,
    '完成解答': 5,
    '正在检查': 6,
    '待裁定': 7,
    '正在裁定': 8,
    '待校对': 9,
    '正在校对': 10,
    '结束录题': 99
}